In [1]:
import pandas as pd
import pymysql
import json
from test_database_function import create_table

In [2]:
tag_lists = [['Gemini', '3200 Phaethon', 'Dust', 'fisheye skyview', 'Earth', 'meteor trails', 'Geminids'],
            ['Erno Berko', 'image', 'meteor showers', 'work', 'picture', '3200 Phaethon']]

In [3]:
test_data = json.dumps(tag_lists)
test_data

'[["Gemini", "3200 Phaethon", "Dust", "fisheye skyview", "Earth", "meteor trails", "Geminids"], ["Erno Berko", "image", "meteor showers", "work", "picture", "3200 Phaethon"]]'

In [4]:
df = pd.DataFrame({'tags': tag_lists})
df

                                                tags
0  [Gemini, 3200 Phaethon, Dust, fisheye skyview,...
1  [Erno Berko, image, meteor showers, work, pict...

In [5]:
df_expanded = df.explode('tags').reset_index(drop=True)
df_expanded

               tags
0            Gemini
1     3200 Phaethon
2              Dust
3   fisheye skyview
4             Earth
5     meteor trails
6          Geminids
7        Erno Berko
8             image
9    meteor showers
10             work
11          picture
12    3200 Phaethon

In [6]:
df_expanded.drop_duplicates()

               tags
0            Gemini
1     3200 Phaethon
2              Dust
3   fisheye skyview
4             Earth
5     meteor trails
6          Geminids
7        Erno Berko
8             image
9    meteor showers
10             work
11          picture

In [7]:
host = 'localhost'
port = 3306
user = 'root'
passwd = 'password'
charset = 'utf8mb4'
conn = pymysql.connect(host=host, user=user, passwd=passwd, charset=charset)
print('Successfully connected!')

Successfully connected!

In [8]:
columns = """
    id INT AUTO_INCREMENT PRIMARY KEY,
    tag_name VARCHAR(255) NOT NULL
"""

In [10]:
create_table(conn, 'Astronomy', 'tag_names', columns)

Table tag_names created successfully in Astronomy.

In [ ]:
engine = create_engine('mysql+pymysql://root:password@localhost:3306/Astronomy')